In [1]:
# Criação de DataFrames e alterações de colunas

In [2]:
import pandas as pd
import numpy as np

In [3]:
# Criar dataframe com duas listas (cada lista uma linha)
s1 = pd.Series([1, 2, 3, 4], name = 'c1')
s2 = pd.Series([1, 2, 3, 4], name = 'c2')

pd.DataFrame([s1,s2])

    0  1  2  3
c1  1  2  3  4
c2  1  2  3  4

In [4]:
# Criar dataframe com duas listas (cada lista uma coluna)
s1 = pd.Series([1, 2, 3, 4], name = 'c1')
s2 = pd.Series([1, 2, 3, 4], name = 'c2')

df = pd.DataFrame({s1.name: s1, s2.name: s2})

In [5]:
df

   c1  c2
0   1   1
1   2   2
2   3   3
3   4   4

In [6]:
# Retonar um valor em uma coluna (c2) e em uma linha (1) 
df['c2'][1]

2

In [7]:
# Criar uma nova coluna a partir de uma constante
df['c3'] = '5'

In [8]:
df

   c1  c2 c3
0   1   1  5
1   2   2  5
2   3   3  5
3   4   4  5

In [9]:
# Remover uma coluna e transfere para outro df

df2 = df.pop('c3')

In [10]:
df2

0    5
1    5
2    5
3    5
Name: c3, dtype: object

In [11]:
# Criar uma nova coluna a partir de uma constante
df['c3'] = '5'

In [12]:
# Remover uma coluna
del df['c3']